// Розробити клас String, який в подальшому буде використовуватися для роботи з рядками.Клас повинен містити :
// • Конструктор за замовчуванням, що дозволяє створити рядок довжиною 80 символів;
// • Конструктор, що дозволяє створювати рядок довільного розміру;
// • Конструктор, який створює рядок і ініціалізує її рядком, отриманої від користувача.
// • Необхідно створити деструктор.
// • Клас повинен містити методи для введення рядків з клавіатури і виведення рядків на екран.
// 
// В клас String додайте перевантаження[], ()
// [] - повертає елемент за вказаною індексу;
// () - шукає символ в рядку, якщо символ є повертає індекс, якщо немає - 1.
// 
// 
// Реалізуйте операцію інкеремента.Вона повинна збільшувати довжину рядка на одиницю.Новий символ заповнюється прогалиною.
// Реалізуйте операцію декремента.Вона повинна зменшувати довжину рядка на одиницю.

#pragma once

class myString {
	char *str;
public:
	myString();
	myString( int sizeStr );
	myString( char str2[] );
	~myString();
	
	void cinS();
	void coutS();
	
	char operator[] ( int index );
	int operator() ( char symbol );
	void operator++ ( int i );
	void operator-- ( int i );
};

